In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("NewJoiners.csv")
df.head()

,Name,Role,City type,Previous CTC,Previous job changes,Graduation marks,Exp (Months),CTC
0,Applicant 1,Manager,Non-Metro,"55,523.00",3,66,19,"71,406.58"
1,Applicant 2,Executive,Metro,"57,081.00",1,84,18,"68,005.87"
2,Applicant 3,Executive,Metro,"60,347.00",2,52,28,"76,764.02"
3,Applicant 4,Executive,Metro,"49,010.00",2,81,33,"82,092.39"
4,Applicant 5,Executive,Metro,"57,879.00",4,74,32,"73,878.10"

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Name                  1338 non-null   object
 1   Role                  1338 non-null   object
 2   City type             1338 non-null   object
 3   Previous CTC          1338 non-null   object
 4   Previous job changes  1338 non-null   int64
 5   Graduation marks      1338 non-null   int64
 6   Exp (Months)          1338 non-null   int64
 7   CTC                   1338 non-null   object
dtypes: int64(3), object(5)
memory usage: 83.8+ KB

In [4]:
df['Role'].value_counts()

Role
Executive    1064
Manager       274
Name: count, dtype: int64